Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: +-----------------------------------------------------------+--------------------------------+ | Hook | Description | +===========================================================+================================+ | ``template:analytic:sidebar`` | Sidebar on analytic pages | +-----------------------------------------------------------+--------------------------------+ | ``template:app:filters-helper:before`` | Filter helper dropdown (top) | +-----------------------------------------------------------+--------------------------------+ | ``template:app:filters-helper:after`` | Filter helper dropdown (bottom)| +-----------------------------------------------------------+--------------------------------+ | ``template:auth:login-form:before`` | Login page (top) | +-----------------------------------------------------------+--------------------------------+ | ``template:auth:login-form:after`` | Login page (bottom) | +-----------------------------------------------------------+--------------------------------+ | ``template:board:private:task:before-title`` | Task in private board: before | | | title | +-----------------------------------------------------------+--------------------------------+ | ``template:board:private:task:after-title`` | Task in private board: after | | | title | +-----------------------------------------------------------+--------------------------------+ | ``template:board:public:task:before-title`` | Task in public board: before | | | title | +-----------------------------------------------------------+--------------------------------+ | ``template:board:public:task:after-title`` | Task in public board: after | | | title | +-----------------------------------------------------------+--------------------------------+ | ``template:board:task:footer`` | Task in board: footer | +-----------------------------------------------------------+--------------------------------+ | ``template:board:task:icons`` | Task in board: tooltip icon | +-----------------------------------------------------------+--------------------------------+ | ``template:board:table:column:before-header-row`` | Row before board column header | | | | +-----------------------------------------------------------+--------------------------------+ | ``template:board:table:column:after-header-row`` | Row after board column header | +-----------------------------------------------------------+--------------------------------+ | ``template:board:column:dropdown`` | Dropdown menu in board columns | +-----------------------------------------------------------+--------------------------------+ | ``template:board:column:header`` | Board column header | +-----------------------------------------------------------+--------------------------------+ | ``template:board:tooltip:subtasks:header:before-assignee``| Header of Subtask table on | | | tootip before Assignee | +-----------------------------------------------------------+--------------------------------+ | ``template:board:tooltip:subtasks:rows`` | Column on row of Subtask table | | | on tooltip | +-----------------------------------------------------------+--------------------------------+ | ``template:config:sidebar`` | Sidebar on settings page | +-----------------------------------------------------------+--------------------------------+ | ``template:config:application`` | Application settings form | +-----------------------------------------------------------+--------------------------------+ | ``template:config:board`` | Board settings form | +-----------------------------------------------------------+--------------------------------+ | ``template:config:email`` | Email settings page | +-----------------------------------------------------------+--------------------------------+ | ``template:config:integrations`` | Integration page in global | | | settings | +-----------------------------------------------------------+--------------------------------+ | ``template:dashboard:show`` | Main page of the dashboard | +-----------------------------------------------------------+--------------------------------+ | ``template:dashboard:page-header:menu`` | Dashboard submenu | +-----------------------------------------------------------+--------------------------------+ | ``template:dashboard:task:footer`` | Task in dashboard: footer | +-----------------------------------------------------------+--------------------------------+ | ``template:header:dropdown`` | Page header dropdown menu | | | (user avatar icon) | +-----------------------------------------------------------+--------------------------------+ | ``template:header:creation-dropdown`` | Page header dropdown menu | | | (plus icon) | +-----------------------------------------------------------+--------------------------------+ | ``template:layout:head`` | Page layout ``<head/>`` tag | +-----------------------------------------------------------+--------------------------------+ | ``template:layout:top`` | Page layout top header | +-----------------------------------------------------------+--------------------------------+ | ``template:layout:bottom`` | Page layout footer | +-----------------------------------------------------------+--------------------------------+ | ``template:project:dropdown`` | “Actions” menu on left in | | | different project views | +-----------------------------------------------------------+--------------------------------+ | ``template:project:header:before`` | Project filters (before) | +-----------------------------------------------------------+--------------------------------+ | ``template:project:header:after`` | Project filters (after) | +-----------------------------------------------------------+--------------------------------+ | ``template:project:integrations`` | Integration page in projects | | | settings | +-----------------------------------------------------------+--------------------------------+ | ``template:project:sidebar`` | Sidebar in project settings | +-----------------------------------------------------------+--------------------------------+ | ``template:project-user:sidebar`` | Sidebar on project user | | | overview page | +-----------------------------------------------------------+--------------------------------+ | ``template:project-list:menu:before`` | Project list: before menu | | | entries | +-----------------------------------------------------------+--------------------------------+ | ``template:project-list:menu:after`` | Project list: after menu | | | entries | +-----------------------------------------------------------+--------------------------------+ | ``template:project-overview:before-description`` | Project overview: before | | | description | +-----------------------------------------------------------+--------------------------------+ | ``template:project-header:view-switcher`` | Project view switcher | +-----------------------------------------------------------+--------------------------------+ | ``template:search:task:footer`` | Task in results: footer | +-----------------------------------------------------------+--------------------------------+ | ``template:task:layout:top`` | Task layout top (after page | | | header) | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:top`` | Task summary top | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:bottom`` | Task summary bottom | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:first-column`` | Task summary first column | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:second-column`` | Task summary second column | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:third-column`` | Task summary third column | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:fourth-column`` | Task summary fourth column | +-----------------------------------------------------------+--------------------------------+ | ``template:task:dropdown`` | Task dropdown menu in listing | | | pages | +-----------------------------------------------------------+--------------------------------+ | ``template:task:sidebar:actions`` | Sidebar on task page (section | | | actions) | +-----------------------------------------------------------+--------------------------------+ | ``template:task:sidebar:information`` | Sidebar on task page (section | | | information) | +-----------------------------------------------------------+--------------------------------+ | ``template:task:form:first-column`` | 1st column in task form | +-----------------------------------------------------------+--------------------------------+ | ``template:task:form:second-column`` | 2nd column in task form | +-----------------------------------------------------------+--------------------------------+ | ``template:task:form:third-column`` | 3nd column in task form | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:top`` | Show task page: top | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:bottom`` | Show task page: bottom | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-description`` | Show task page: before | | | description | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-tasklinks`` | Show task page: before | | | tasklinks | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-subtasks`` | Show task page: before | | | subtasks | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-timetracking`` | Show task page: before | | | timetracking | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-attachments`` | Show task page: before | | | attachments | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-comments`` | Show task page: before | | | comments | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:form:create`` | Create Subtask form | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:form:edit`` | Edit Subtask form | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:table:header:before-timetracking`` | Subtask table header before | | | Time Tracking | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:table:rows`` | Column on row of subtasks | | | table | +-----------------------------------------------------------+--------------------------------+ | ``template:user:authentication:form`` | “Edit authentication” form in | | | user profile | +-----------------------------------------------------------+--------------------------------+ | ``template:user:create-remote:form`` | “Create remote user” form | +-----------------------------------------------------------+--------------------------------+ | ``template:user:external`` | “External authentication” page | | | in user profile | +-----------------------------------------------------------+--------------------------------+ | ``template:user:integrations`` | Integration page in user | | | profile | +-----------------------------------------------------------+--------------------------------+ | ``template:user:sidebar:actions`` | Sidebar in user profile | | | (section actions) | +-----------------------------------------------------------+--------------------------------+ | ``template:user:sidebar:information`` | Sidebar in user profile | | | (section information) | +-----------------------------------------------------------+--------------------------------+ | ``template:user:show:profile:info`` | User profile information | +-----------------------------------------------------------+--------------------------------+
ja: +-----------------------------------------------------------+--------------------------------+ | フック | 概要 | +===========================================================+================================+ | ``template:analytic:sidebar`` | 統計ページのサイドバー | +-----------------------------------------------------------+--------------------------------+ | ``template:app:filters-helper:before`` | フィルターのヘルパーのドロップダウン (上部) | +-----------------------------------------------------------+--------------------------------+ | ``template:app:filters-helper:after`` | フィルターのヘルパーのドロップダウン (下部)| +-----------------------------------------------------------+--------------------------------+ | ``template:auth:login-form:before`` | ログインページ (上部) | +-----------------------------------------------------------+--------------------------------+ | ``template:auth:login-form:after`` | ログインページ (下部) | +-----------------------------------------------------------+--------------------------------+ | ``template:board:private:task:before-title`` | 個人ボード内のタスク: タイトルの前 | +-----------------------------------------------------------+--------------------------------+ | ``template:board:private:task:after-title`` | 個人ボード内のタスク: タイトルの後 | +-----------------------------------------------------------+--------------------------------+ | ``template:board:public:task:before-title`` | 公開ボード内のタスク: タイトルの前 | +-----------------------------------------------------------+--------------------------------+ | ``template:board:public:task:after-title`` | 公開ボード内のタスク: タイトルの後 | +-----------------------------------------------------------+--------------------------------+ | ``template:board:task:footer`` | ボード内タスク: フッター | +-----------------------------------------------------------+--------------------------------+ | ``template:board:task:icons`` | ボード内タスク: ツールチップのアイコン | +-----------------------------------------------------------+--------------------------------+ | ``template:board:table:column:before-header-row`` | ボードのヘッダー列より上の行 | +-----------------------------------------------------------+--------------------------------+ | ``template:board:table:column:after-header-row`` | ボードのヘッダー列以降の行 | +-----------------------------------------------------------+--------------------------------+ | ``template:board:column:dropdown`` | ボードのカラム内のドロップダウンメニュー | +-----------------------------------------------------------+--------------------------------+ | ``template:board:column:header`` | ボードのカラムのヘッダー | +-----------------------------------------------------------+--------------------------------+ | ``template:board:tooltip:subtasks:header:before-assignee``| サブタスクの表のヘッダー上で、未割当サブタスクのツールチップ | +-----------------------------------------------------------+--------------------------------+ | ``template:board:tooltip:subtasks:rows`` | Column on row of Subtask table on tooltip | +-----------------------------------------------------------+--------------------------------+ | ``template:config:sidebar`` | 設定ページ上のサイドバー | +-----------------------------------------------------------+--------------------------------+ | ``template:config:application`` | アプリケーションの設定フォーム | +-----------------------------------------------------------+--------------------------------+ | ``template:config:board`` | ボードの設定フォーム | +-----------------------------------------------------------+--------------------------------+ | ``template:config:email`` | Email の設定ページ | +-----------------------------------------------------------+--------------------------------+ | ``template:config:integrations`` | グローバル設定内の連携のページ | +-----------------------------------------------------------+--------------------------------+ | ``template:dashboard:show`` | ダッシュボードのメインページ | +-----------------------------------------------------------+--------------------------------+ | ``template:dashboard:page-header:menu`` | ダッシュボードのサブメニュー | +-----------------------------------------------------------+--------------------------------+ | ``template:dashboard:task:footer`` | ダッシュボード内のタスク: フッター | +-----------------------------------------------------------+--------------------------------+ | ``template:header:dropdown`` | ドロップダウンメニューのページのヘッダー | | | (ユーザーアバターのアイコン) | +-----------------------------------------------------------+--------------------------------+ | ``template:header:creation-dropdown`` | ドロップダウンメニューのページのヘッダー | | | (＋ アイコン) | +-----------------------------------------------------------+--------------------------------+ | ``template:layout:head`` | ``<head/>``タグでのページレイアウト | +-----------------------------------------------------------+--------------------------------+ | ``template:layout:top`` | ヘッダーのページレイアウト | +-----------------------------------------------------------+--------------------------------+ | ``template:layout:bottom`` | フッターのページレイアウト | +-----------------------------------------------------------+--------------------------------+ | ``template:project:dropdown`` | “Actions” menu on left in | | | different project views | +-----------------------------------------------------------+--------------------------------+ | ``template:project:header:before`` | プロジェクトフィルター (前) | +-----------------------------------------------------------+--------------------------------+ | ``template:project:header:after`` | プロジェクトフィルター (後) | +-----------------------------------------------------------+--------------------------------+ | ``template:project:integrations`` | プロジェクト設定内の連携のページ | +-----------------------------------------------------------+--------------------------------+ | ``template:project:sidebar`` | プロジェクト設定内のサイドバー | +-----------------------------------------------------------+--------------------------------+ | ``template:project-user:sidebar`` | プロジェクトのユーザー概要ページのサイドバー | +-----------------------------------------------------------+--------------------------------+ | ``template:project-list:menu:before`` | プロジェクトのリスト: メニューエントリーの前 | +-----------------------------------------------------------+--------------------------------+ | ``template:project-list:menu:after`` | プロジェクトのリスト: メニューエントリーの後 | +-----------------------------------------------------------+--------------------------------+ | ``template:project-overview:before-description`` | プロジェクト概要: プロジェクトの説明の前 | +-----------------------------------------------------------+--------------------------------+ | ``template:project-header:view-switcher`` | プロジェクトビュー切り替え | +-----------------------------------------------------------+--------------------------------+ | ``template:search:task:footer`` | Task in results: footer | +-----------------------------------------------------------+--------------------------------+ | ``template:task:layout:top`` | タスクのレイアウトのトップ (ページのヘッダーの後) | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:top`` | タスク概要トップ | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:bottom`` | タスク概要の下 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:first-column`` | タスク概要の1番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:second-column`` | タスク概要の2番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:third-column`` | タスク概要の3番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:details:fourth-column`` | タスク概要の4番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:dropdown`` | Task dropdown menu in listing | | | pages | +-----------------------------------------------------------+--------------------------------+ | ``template:task:sidebar:actions`` | Sidebar on task page (section | | | actions) | +-----------------------------------------------------------+--------------------------------+ | ``template:task:sidebar:information`` | Sidebar on task page (section | | | information) | +-----------------------------------------------------------+--------------------------------+ | ``template:task:form:first-column`` | タスクのフォームの1番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:form:second-column`` | タスクのフォームの2番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:form:third-column`` | タスクのフォームの3番目のカラム | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:top`` | タスクのページを表示: 先頭 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:bottom`` | タスクのページを表示: 末尾 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-description`` | タスクのページを表示: 概要の前 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-tasklinks`` | タスクのページを表示: タスクリンクの前 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-subtasks`` | タスクのページを表示: サブタスクの前 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-timetracking`` | タスクのページを表示: 時間追跡の前 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-attachments`` | タスクのページを表示: 添付の前 | +-----------------------------------------------------------+--------------------------------+ | ``template:task:show:before-comments`` | タスクのページを表示: コメントの前 | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:form:create`` | サブタスク作成フォーム | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:form:edit`` | サブタスク編集フォーム | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:table:header:before-timetracking`` | 時間追跡の前のサブタスクの表のヘッダー | +-----------------------------------------------------------+--------------------------------+ | ``template:subtask:table:rows`` | Column on row of subtasks | | | table | +-----------------------------------------------------------+--------------------------------+ | ``template:user:authentication:form`` | ユーザー設定内の “'認証の編集” フォーム | +-----------------------------------------------------------+--------------------------------+ | ``template:user:create-remote:form`` | “リモートユーザーを作成" フォーム | +-----------------------------------------------------------+--------------------------------+ | ``template:user:external`` | ユーザー設定内の “外部認証を設定” ページ | +-----------------------------------------------------------+--------------------------------+ | ``template:user:integrations`` | ユーザー設定内の "連携" ページ | +-----------------------------------------------------------+--------------------------------+ | ``template:user:sidebar:actions`` | ユーザー設定内のサイドバー (section actions) | +-----------------------------------------------------------+--------------------------------+ | ``template:user:sidebar:information`` | ユーザー設定内のサイドバー (section information) | +-----------------------------------------------------------+--------------------------------+ | ``template:user:show:profile:info`` | ユーザー設定情報 | +-----------------------------------------------------------+--------------------------------+
